#version: 0.2
c c
C C
( =
cc c
] (
@ @
C c
N C
cc ccc
n c
CC C
) [
N H
+ ]
C O
cc cc
N c
C l
O C
CC N
) (
CO c
( -
( [
CC CC
C N
) (=
- ]
CC O
n H
n n
-] )
+ ](
CC c
) =
s c
C S
n cc
B r
C NC
n nc
N Cc
o c
1 2
CC CCC
+] (=
CO C
C n
2 1
CCC N
c n
O c
CC OC
+] [
CCO CC
c nc
CC S
]( [
CCO c
ccc s
ccc nc
N CC
O CC
( /
CCC O
@ ]
CS c
ccc o
@@ ]
c nn
CC n
CC NC
3 2
cccc n
2 3
n o
+] )
n oc
) /
c sc
c s
cc ncc
ccc n
CC Cc
S c
S CC
cc nc
S C
O Cc
cc sc
cc n
N NC
O CO
@ ](
nc nc
N S
N CCc
@@ ](
C Nc
O CCO
= [
n cccc
c ncc
N N
CCCC CC
N CCC
o n
+]( [
CC CCN
CCC NC
nc n
-] )[
ncc s
+] =
CS C
CCC n
s ccc
S Cc
CCS c
cnc n
( \
CO CC
3 4
nn nn
n ccc
CO Cc
cc oc
)( [
ncc n
CCC Oc
n cccn
cc nn
CN S
@@] (=
CCS C
4 3
CO CCN
F c
CCS CC
CCC S
cncc n
-]) =
/ [
@] (=
c oc
c nnc
CS CC
nn n
N Nc
nn nc
N CCN
nnc n
+] )[
CCCC O
nc nn
CC l
CC Nc
Cl c
CS Cc
O CCCO
cnn n
NCC NC
o ccc
o nc
CCN S
O CCC
)= [
CCC OC
CCCC NC
CO CCn
ncc nc
F C
CCCC CCC
cs cc
1 3
N O
cn ccc
(\ [
O CCN
n s
n sc
CO CCNC
N CCOc
CCCC n
csc n
NCC n
NCCC n
+] )(
NCC Cc
CCCC c
cc on
sc nc
CCC Nc
nc sc
N n
N CCCN
no nc
Br c
N CCS
S CCC
CO CCO
nnc s
CN Cc
s cc
s ccn
N CCCC
(= [
CO CCOc
3 1
oc nc
ns nc
O CCc
CCO Cc
O S
nc oc
cnc nc
CO CCC
NCC Nc
CCC l
nn sc
CS CCS
CO CCCNC
S CCc
c o
CCCC S
OCC NC
N CCO
CCC Sc
+] \
-]) /
CS CN
CCCC Oc
\ [
CCCCC N
CO CCCN
CS CCO
) -
O CCOc
ccc nn
CO N
CCO CCN
N CCCO
S CCN
+] /
CCC SCC
OCC n
cs nn
@ ]([
C Br
4 5
cc no
O CCCC
]( /
)( /
CS CCC
s nc
@@ ]([
CO CCc
O N
CCC SC
2 4
+] )([
O COC
ccnc n
N CCSc
CCC OCC
CCN CC
nn cc
CCCCC NC
(/ [
5 4
nc on
CO CCCC
N CCOC
CCCC OC
CS CCN
ncc o
CCS Cc
nnc o
CO NC
s nnc
CO CCOC
4 2
nc ncc
CCN Cc
N CCOCC
N NS
O CCCN
N OCc
OCC Cc
) \
N CCCCn
O CCCNC
S CCOc
CCC F
CCCN S
OCC Nc
CCCC l
CCO CCO
NCCC OC
O CCS
S CCS
o cc
CN CCc
CCCCC n
CO CCCn
CN CC
CCO CCCNC
NCCC NC
Cl C
-] )(
-]) =[
O CCOC
cn oc
cnc s
NC N
CCCC Sc
CN n
CCO CCC
NCCC Sc
S CCO
CCCC Nc
CCO NC
N OC
CO CO
CN N
CN CCN
-] [
CCOCC NC
NCCC S
NCCC Oc
N CCCCC
O CCSc
] /
OC n
CS CCNC
N OCC
O CCCn
cc s
+] =[
OC N
(- [
CCO CCCC
CCCCC O
CCOCC S
CCOCC n
CCS CCC
COCC Nc
NCCN S
S CCCS
s n
cc nnc
CC Br
CO CCOCC
CO CCSc
Cl Cc
CCCC Cc
-] /
CS CCCNC
cnc o
cnn s
)/ [
COCCN S
O CCCOc
] [
CO CCCOc
CS CCCN
NCC CCN
CO CCS
CO CCCNc
CCO CCOc
CCCCC S
N CCSC
O P
S CCCC
CO n
CO CCCOC
CCCC OCC
CCCC CCNC
CS CCc
CS CCn
Br Cc
NCCCN S
3 5
S CCn
o ncc
CO P
Cl CC
-] =[
CCO P
CS CCCCNC
cn sn
OCCO CCOCCO
NCCC Nc
OCCC l
OCCC Sc
C I
N CCCCCC
N CCSCC
N CCOCc
O CCCCC
O CCNS
O CCSCc
S CN
S Cn
S CCNC
S CCCOc
c onc
CO COc
CCCC CCCCCCC
CCO CCOC
CCOCC Cc
OCC CCN
CCCO Cc
NCCC OCC
ns cc
NCCCC l
NCCCC Oc
4 1
C H
N SC
O H
O n
O CCOCC
O CCSCC
O CCCS
S N
S CCCc
]( /[
CCC SCc
CO S
CO CCCCC
CCCC CCCC
CCCC CCO
CCCC CCS
CN CCC
-] )([
CCO CCCN
CCO CCCNc
CCO CCOCc
+]( -
CS CCOc
CS CCSC
CCCN CC
cn sc
CCOCC Nc
CCS S
CCS CCOC
OCC F
OCC Br
NCCS Cc
( #
- [
3 12
F CCC
I C
I c
N Oc
O NC
O CCSC
O CCCCn
O CCOCCS
S H
S CCOC
S CCCO
S CCSc
s sc
s snc
CCC Br
CCC NCc
CO CCCCN
CO CCCS
CO CCSCc
CO CCOCCNC
Cl CCCSc
CCCC CCN
CCCC SC
CCCC OCc
CCO CCOCC
CCO CCCn
nn ccc
-]) \
+]( /
+]( /[
CS CCCC
CS CCOC
CS CCCNc
Br CC
Br CCC
12 3
CCCCC OC
CCCCC Oc
CCCCC Sc
CCOCC Sc
CCS CCOc
NN N
NCCC SC
CCCCN S
COCCN Cc
OCCC Nc
OCCC SC
NO CCc
COCCO CCN
NCCO CCO
CCOCCO CCOCC
OCCOCCOCCO CCO
